DOCFSKDEVII.ИИАнализДокументовOllama/src/InformationRegisters/ИАДО_ОчередьРаспознаванияФайлов/ИАДО_ОчередьРаспознаванияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИАДО_ОчередьРаспознаванияФайлов</name>
  <comment>Служебная очередь для последовательного запуска штатного распознавания файлов перед анализом ИИ.</comment>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ДокументыПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Файл</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </resources>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DOCFSKDEVII.ИИАнализДокументовOllama/src/CommonModules/ИАДО_ИнтеграцияИИВызовСервера/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Запускает длительную операцию ИИ в фоне (БСП ДлительныеОперации).
//
// Параметры:
//  ПараметрыОперации - Структура - обязательно ИмяОперации; для «АнализФайла»: Документ, Файл.
//  ИдентификаторФормы - УникальныйИдентификатор - идентификатор формы-владельца.
//
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьФункцию
//
Функция НачатьОперациюИИВФоне(Знач ПараметрыОперации, Знач ИдентификаторФормы = Неопределено) Экспорт

	Если ИдентификаторФормы = Неопределено Тогда
		ИдентификаторФормы = Новый УникальныйИдентификатор();
	КонецЕсли;

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'ИИ (Ollama): выполнение операции'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"ИАДО_ИнтеграцияИИВызовСервера.ВыполнитьОперациюИИВФоне",
		ПараметрыОперации);

КонецФункции

// Обработчик фонового задания; вызывается только подсистемой длительных операций.
//
// Параметры:
//  ПараметрыОперации - Структура - параметры, переданные из НачатьОперациюИИВФоне (ИмяОперации и др.).
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево - признак успешного выполнения операции.
//   * Сообщение - Строка - текст ошибки/диагностики, пустая строка при успехе.
//   * ТекстМодели - Строка - добавляется только для операции «АнализФайла» при успехе.
//
Функция ВыполнитьОперациюИИВФоне(Знач ПараметрыОперации) Экспорт

	ИмяОперации = "";
	Если ТипЗнч(ПараметрыОперации) = Тип("Структура") И ПараметрыОперации.Свойство("ИмяОперации") Тогда
		ИмяОперации = ПараметрыОперации.ИмяОперации;
	КонецЕсли;

	Если ИмяОперации = "АнализФайла" Тогда
		Возврат ВыполнитьАнализФайлаВФоне(ПараметрыОперации);
	КонецЕсли;

	Возврат Новый Структура("Успех, Сообщение, ТекстМодели", Ложь, НСтр("ru = 'Неизвестная операция ИИ'"), "");

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет анализ файла в фоне: подготовка текста, обращение к модели ИИ, журналирование.
//
// Параметры:
//  ПараметрыОперации - Структура - обязательные поля: Документ (СправочникСсылка.ДокументыПредприятия),
//   Файл (СправочникСсылка.Файлы).
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево - признак успешного получения ответа модели.
//   * Сообщение - Строка - текст ошибки/диагностики, пустая строка при успехе.
//   * ТекстМодели - Строка - ответ модели; заполняется только при Успех = Истина.
//
Функция ВыполнитьАнализФайлаВФоне(Знач ПараметрыОперации)

	ДокументСсылка = ПараметрыОперации.Документ;
	ФайлСсылка = ПараметрыОперации.Файл;

	РеквДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ВидДокумента, Тематика");
	ПараметрыАнализа = ИАДО_НастройкиАнализаИИВызовСервера.ПараметрыАнализаДокументаПоПравилам(
		РеквДок.ВидДокумента, РеквДок.Тематика);

	ПодготовкаТекста = ИАДО_ПодготовитьТекстДляАнализаСПриНеобходимостиРаспознавания(ФайлСсылка, ДокументСсылка);

	Если Не ПодготовкаТекста.ДоступенДляМодели Тогда

		ПарамЖурнал = Новый Структура;
		ПарамЖурнал.Вставить("ВидОперации", "АнализФайла");
		ПарамЖурнал.Вставить("Успешно", Ложь);
		ПарамЖурнал.Вставить("Сообщение", ПодготовкаТекста.СообщениеОбОшибке);
		ПарамЖурнал.Вставить("Документ", ДокументСсылка);
		ПарамЖурнал.Вставить("Файл", ФайлСсылка);
		ИАДО_ЖурналИИВызовСервера.ДобавитьЗапись(ПарамЖурнал);

		Возврат Новый Структура("Успех, Сообщение, ТекстМодели", Ложь, ПодготовкаТекста.СообщениеОбОшибке, "");

	КонецЕсли;

	Если Не ЗначениеЗаполнено(ПараметрыАнализа.Эксперт) Или ПустаяСтрока(ПараметрыАнализа.ИмяМодели) Тогда

		ТекстОшибки = НСтр("ru = 'Не найден эксперт ИИ по правилам для данного документа.'");
		ПарамЖурнал = Новый Структура;
		ПарамЖурнал.Вставить("ВидОперации", "АнализФайла");
		ПарамЖурнал.Вставить("Успешно", Ложь);
		ПарамЖурнал.Вставить("Сообщение", ТекстОшибки);
		ПарамЖурнал.Вставить("Документ", ДокументСсылка);
		ПарамЖурнал.Вставить("Файл", ФайлСсылка);
		ПарамЖурнал.Вставить("ИсточникТекстаФайла", ПодготовкаТекста.ИсточникТекста);
		ИАДО_ЖурналИИВызовСервера.ДобавитьЗапись(ПарамЖурнал);

		Возврат Новый Структура("Успех, Сообщение, ТекстМодели", Ложь, ТекстОшибки, "");

	КонецЕсли;

	Если ПустаяСтрока(СокрЛП(ПараметрыАнализа.ПромптОбработкиДокумента)) Тогда

		ТекстОшибки = НСтр("ru = 'Для подобранного правила не задан промпт. Укажите текст в ресурсе «Промпт обработки документа» в строке регистра ИАДО_ПравилаЭкспертовДокументов для данного вида и тематики.'");
		ПарамЖурнал = Новый Структура;
		ПарамЖурнал.Вставить("ВидОперации", "АнализФайла");
		ПарамЖурнал.Вставить("Успешно", Ложь);
		ПарамЖурнал.Вставить("Сообщение", ТекстОшибки);
		ПарамЖурнал.Вставить("Документ", ДокументСсылка);
		ПарамЖурнал.Вставить("Файл", ФайлСсылка);
		ПарамЖурнал.Вставить("ИсточникТекстаФайла", ПодготовкаТекста.ИсточникТекста);
		ИАДО_ЖурналИИВызовСервера.ДобавитьЗапись(ПарамЖурнал);

		Возврат Новый Структура("Успех, Сообщение, ТекстМодели", Ложь, ТекстОшибки, "");

	КонецЕсли;

	МаксДлинаТекста = 200000;
	ТекстДок = ПодготовкаТекста.ТекстДляПромпта;
	Если СтрДлина(ТекстДок) > МаксДлинаТекста Тогда
		ТекстДок = Лев(ТекстДок, МаксДлинаТекста) + Символы.ПС + НСтр("ru = '...[фрагмент текста обрезан для промпта]...'");
	КонецЕсли;

	ПромптПравила = СокрЛП(ПараметрыАнализа.ПромптОбработкиДокумента);
	ПользовательскийПромпт = ПромптПравила;
	Если Не ПустаяСтрока(ПользовательскийПромпт) Тогда
		ПользовательскийПромпт = ПользовательскийПромпт + Символы.ПС + Символы.ПС;
	КонецЕсли;
	ПользовательскийПромпт = ПользовательскийПромпт + ТекстДок;

	ПарамСобытияЖурнала = Новый Структура;
	ПарамСобытияЖурнала.Вставить("ВидОперации", "ОбращениеКМоделиНачало");
	ПарамСобытияЖурнала.Вставить("Успешно", Истина);
	ПарамСобытияЖурнала.Вставить("Сообщение", НСтр("ru = 'Запуск обращения к модели ИИ'"));
	ПарамСобытияЖурнала.Вставить("Документ", ДокументСсылка);
	ПарамСобытияЖурнала.Вставить("Файл", ФайлСсылка);
	ПарамСобытияЖурнала.Вставить("ИмяМодели", ПараметрыАнализа.ИмяМодели);
	ПарамСобытияЖурнала.Вставить("ИсточникТекстаФайла", ПодготовкаТекста.ИсточникТекста);
	ПарамСобытияЖурнала.Вставить("Детали", Новый Структура(
		"ПровайдерИИ, ДлинаПромпта", ПараметрыАнализа.ПровайдерИИ, СтрДлина(ПользовательскийПромпт)));
	ИАДО_ЗаписатьСобытиеЖурналаИИ(ПарамСобытияЖурнала);

	РезультатВызова = ИАДО_ИнтеграцияOllamaВызовСервера.СгенерироватьОтвет(
		ИАДО_НастройкиАнализаИИВызовСервера.БазовыйURL_Ollama(),
		ИАДО_НастройкиАнализаИИВызовСервера.ТаймаутHTTPСекунд(),
		ПараметрыАнализа.ИмяМодели,
		ПользовательскийПромпт,
		ПараметрыАнализа.СистемныйПромпт);

	ПарамЖурнал = Новый Структура;
	ПарамЖурнал.Вставить("ВидОперации", "АнализФайла");
	ПарамЖурнал.Вставить("Успешно", РезультатВызова.Успех);
	ПарамЖурнал.Вставить("Документ", ДокументСсылка);
	ПарамЖурнал.Вставить("Файл", ФайлСсылка);
	ПарамЖурнал.Вставить("ИмяМодели", ПараметрыАнализа.ИмяМодели);
	ПарамЖурнал.Вставить("ИсточникТекстаФайла", ПодготовкаТекста.ИсточникТекста);
	ПарамЖурнал.Вставить("HTTPКод", РезультатВызова.HTTPКод);

	Если РезультатВызова.Успех Тогда
		ПарамЖурнал.Вставить("Сообщение", НСтр("ru = 'Ответ модели получен'"));
		ПарамЖурнал.Вставить("ТекстОтветаКратко", Лев(РезультатВызова.ТекстМодели, 500));
	Иначе
		ТекстОшибки = РезультатВызова.СообщениеОбОшибке;
		Если ПустаяСтрока(ТекстОшибки) Тогда
			ТекстОшибки = РезультатВызова.ТекстОтвета;
		КонецЕсли;
		ПарамЖурнал.Вставить("Сообщение", ТекстОшибки);
	КонецЕсли;

	ИАДО_ЖурналИИВызовСервера.ДобавитьЗапись(ПарамЖурнал);

	Если РезультатВызова.Успех Тогда

		Попытка
			ИАДО_ОтветИИФайлДокументаВызовСервера.СоздатьФайлОтветаИИПоДокументу(
				ДокументСсылка,
				ФайлСсылка,
				РезультатВызова.ТекстМодели);
		Исключение
			ИАДО_ИгнорироватьОшибкуСозданияВложенияОтветаИИ();
		КонецПопытки;

		Возврат Новый Структура("Успех, Сообщение, ТекстМодели", Истина, "", РезультатВызова.ТекстМодели);

	КонецЕсли;

	ТекстОшибки = РезультатВызова.СообщениеОбОшибке;
	Если ПустаяСтрока(ТекстОшибки) Тогда
		ТекстОшибки = РезультатВызова.ТекстОтвета;
	КонецЕсли;

	Возврат Новый Структура("Успех, Сообщение, ТекстМодели", Ложь, ТекстОшибки, "");

КонецФункции

// Подготавливает текст файла для модели; при отсутствии текста и включенном распознавании ДО инициирует
// РаботаСФайламиВызовСервера.РаспознатьФайл и ожидает появления данных в регистре «Тексты версий файлов».
//
Функция ИАДО_ПодготовитьТекстДляАнализаСПриНеобходимостиРаспознавания(Знач ФайлСсылка, Знач ДокументСсылка)

	ПодготовкаТекста = ИАДО_ТекстФайлаДляИИВызовСервера.ПодготовитьТекстВерсииФайлаДляМодели(ФайлСсылка);
	Если ПодготовкаТекста.ДоступенДляМодели Тогда
		Возврат ПодготовкаТекста;
	КонецЕсли;

	ИдентификаторОчереди = ИАДО_ПоставитьВОчередьРаспознавания(ФайлСсылка, ДокументСсылка);
	Если Не ИАДО_ДождатьсяСвоейОчередиРаспознавания(ИдентификаторОчереди, ДокументСсылка, ФайлСсылка) Тогда
		ПодготовкаТекста.СообщениеОбОшибке = ПодготовкаТекста.СообщениеОбОшибке + Символы.ПС
			+ НСтр("ru = 'Истекло время ожидания своей очереди распознавания (5 мин).'");		
		ИАДО_ЗавершитьОчередьРаспознавания(
			ИдентификаторОчереди, ДокументСсылка, ФайлСсылка, "Ошибка", ПодготовкаТекста.СообщениеОбОшибке);
		Возврат ПодготовкаТекста;
	КонецЕсли;

	Если Не ИАДО_РаспознаваниеФайлаДоступноПередАнализомИИ(ФайлСсылка) Тогда
		ИАДО_ЗавершитьОчередьРаспознавания(ИдентификаторОчереди, ДокументСсылка, ФайлСсылка, "Завершено", "");
		Возврат ПодготовкаТекста;
	КонецЕсли;

	ИОМВладельца = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ДокументСсылка));
	ПараметрыРаспознавания = РаботаСФайламиВызовСервера.ПодготовитьПараметрыРаспознавания(ИОМВладельца);
	Если ПараметрыРаспознавания = Неопределено Тогда
		ИАДО_ЗавершитьОчередьРаспознавания(ИдентификаторОчереди, ДокументСсылка, ФайлСсылка, "Завершено", "");
		Возврат ПодготовкаТекста;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ПараметрыРаспознавания.СтратегияРаспознавания)
		Или ПараметрыРаспознавания.СтратегияРаспознавания = Перечисления.СтратегииРаспознаванияТекста.НеРаспознавать Тогда

		ПараметрыРаспознавания.СтратегияРаспознавания =
			Перечисления.СтратегииРаспознаванияТекста.ПоместитьТолькоВТекстовыйОбраз;

	КонецЕсли;

	ОписаниеОшибки = "";
	РаспознанныйТекст = "";
	РезультатРаспознавания = РаботаСФайламиВызовСервера.РаспознатьФайл(
		ФайлСсылка,
		ПараметрыРаспознавания,
		ОписаниеОшибки,
		РаспознанныйТекст,
		Неопределено,
		Истина);

	Если РезультатРаспознавания = "Ошибка" Тогда

		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			ПодготовкаТекста.СообщениеОбОшибке = ПодготовкаТекста.СообщениеОбОшибке + Символы.ПС
				+ НСтр("ru = 'Запуск распознавания (Документооборот):'") + " " + ОписаниеОшибки;
		КонецЕсли;

		ИАДО_ЗавершитьОчередьРаспознавания(ИдентификаторОчереди, ДокументСсылка, ФайлСсылка, "Ошибка", ОписаниеОшибки);
		Возврат ПодготовкаТекста;

	КонецЕсли;

	МаксимальноеОжиданиеМс = 300000;
	ИнтервалОпросаСек = 2;
	ВремяНачалаОжидания = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Пока Истина Цикл

		ПодготовкаТекста = ИАДО_ТекстФайлаДляИИВызовСервера.ПодготовитьТекстВерсииФайлаДляМодели(ФайлСсылка);
		Если ПодготовкаТекста.ДоступенДляМодели Тогда
			ИАДО_ЗавершитьОчередьРаспознавания(ИдентификаторОчереди, ДокументСсылка, ФайлСсылка, "Завершено", "");
			Возврат ПодготовкаТекста;
		КонецЕсли;

		РеквизитыФайла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФайлСсылка, "ТекущаяВерсия");
		ВерсияФайла = РеквизитыФайла.ТекущаяВерсия;
		СтатусРаспознавания = Неопределено;

		Если ЗначениеЗаполнено(ВерсияФайла) Тогда
			СтатусРаспознавания = РегистрыСведений.ТекстыВерсийФайлов.ПрочитатьСтатусРаспознавания(ВерсияФайла);
		КонецЕсли;

		Если СтатусРаспознавания = Перечисления.СтатусыРаспознаванияТекста.НеРаспознано Тогда
			ПодготовкаТекста.СообщениеОбОшибке = ПодготовкаТекста.СообщениеОбОшибке + Символы.ПС
				+ НСтр("ru = 'Распознавание завершилось со статусом «Не распознано»; текст для модели недоступен.'");
			ИАДО_ЗавершитьОчередьРаспознавания(
				ИдентификаторОчереди, ДокументСсылка, ФайлСсылка, "Ошибка", ПодготовкаТекста.СообщениеОбОшибке);
			Возврат ПодготовкаТекста;
		КонецЕсли;

		Если ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачалаОжидания > МаксимальноеОжиданиеМс Тогда

			ПодготовкаТекста = ИАДО_ТекстФайлаДляИИВызовСервера.ПодготовитьТекстВерсииФайлаДляМодели(ФайлСсылка);
			Если Не ПодготовкаТекста.ДоступенДляМодели Тогда
				ПодготовкаТекста.СообщениеОбОшибке = ПодготовкаТекста.СообщениеОбОшибке + Символы.ПС
					+ НСтр("ru = 'Истекло время ожидания распознавания (5 мин). Повторите анализ позже или дождитесь окончания распознавания в карточке файла.'");
			КонецЕсли;

			ИАДО_ЗавершитьОчередьРаспознавания(
				ИдентификаторОчереди, ДокументСсылка, ФайлСсылка, "Ошибка", ПодготовкаТекста.СообщениеОбОшибке);
			Возврат ПодготовкаТекста;

		КонецЕсли;

		ОбщегоНазначенияБТС.Пауза(ИнтервалОпросаСек);

	КонецЦикла;

КонецФункции

Функция ИАДО_ПоставитьВОчередьРаспознавания(Знач ФайлСсылка, Знач ДокументСсылка)

	Идентификатор = Строка(Новый УникальныйИдентификатор());
	НаборЗаписей = РегистрыСведений.ИАДО_ОчередьРаспознаванияФайлов.СоздатьНаборЗаписей();
	Запись = НаборЗаписей.Добавить();
	Запись.ДатаВремя = ТекущаяУниверсальнаяДата();
	Запись.Идентификатор = Идентификатор;
	Запись.Статус = "Ожидает";
	Запись.Файл = ФайлСсылка;
	Запись.Документ = ДокументСсылка;
	Запись.Сообщение = "";
	НаборЗаписей.Записать(Ложь);

	ПарамСобытияЖурнала = Новый Структура;
	ПарамСобытияЖурнала.Вставить("ВидОперации", "РаспознаваниеОчередь");
	ПарамСобытияЖурнала.Вставить("Успешно", Истина);
	ПарамСобытияЖурнала.Вставить("Сообщение", НСтр("ru = 'Файл поставлен в очередь распознавания'"));
	ПарамСобытияЖурнала.Вставить("Документ", ДокументСсылка);
	ПарамСобытияЖурнала.Вставить("Файл", ФайлСсылка);
	ПарамСобытияЖурнала.Вставить("Детали", Новый Структура("ИдентификаторОчереди", Идентификатор));
	ИАДО_ЗаписатьСобытиеЖурналаИИ(ПарамСобытияЖурнала);

	Возврат Идентификатор;

КонецФункции

Функция ИАДО_ДождатьсяСвоейОчередиРаспознавания(Знач ИдентификаторОчереди, Знач ДокументСсылка, Знач ФайлСсылка)

	МаксОжиданиеМс = 300000;
	ИнтервалОпросаСек = 2;
	ВремяНачалаОжидания = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Пока ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачалаОжидания <= МаксОжиданиеМс Цикл

		ИдентификаторПервойЗаявки = ИАДО_ПервыйИдентификаторИзОчередиОжидания();
		Если ПустаяСтрока(ИдентификаторПервойЗаявки) Тогда
			ОбщегоНазначенияБТС.Пауза(ИнтервалОпросаСек);
			Продолжить;
		КонецЕсли;

		Если ИдентификаторПервойЗаявки = ИдентификаторОчереди Тогда
			ИАДО_ОбновитьСтатусОчередиРаспознавания(
				ИдентификаторОчереди, ДокументСсылка, ФайлСсылка, "Выполняется", "");
			Возврат Истина;
		КонецЕсли;

		ОбщегоНазначенияБТС.Пауза(ИнтервалОпросаСек);

	КонецЦикла;

	Возврат Ложь;

КонецФункции

Функция ИАДО_ПервыйИдентификаторИзОчередиОжидания()

	// Учитываем только актуальный статус заявки (последняя запись по Идентификатору), иначе после смены
	// статуса на «Выполняется» старая строка «Ожидает» остаётся в регистре и ломает порядок очереди.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АктуальныеОжидающие.Идентификатор КАК Идентификатор
	|ИЗ
	|	(ВЫБРАТЬ
	|		Срез.Идентификатор КАК Идентификатор,
	|		Срез.Статус КАК Статус,
	|		Постановка.ДатаВремяПостановки КАК ДатаВремяПостановки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Очередь.Идентификатор КАК Идентификатор,
	|			МАКСИМУМ(Очередь.ДатаВремя) КАК ДатаВремяПоследнейЗаписи
	|		ИЗ
	|			РегистрСведений.ИАДО_ОчередьРаспознаванияФайлов КАК Очередь
	|		СГРУППИРОВАТЬ ПО
	|			Очередь.Идентификатор) КАК КлючиПоследнейЗаписи
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИАДО_ОчередьРаспознаванияФайлов КАК Срез
	|			ПО КлючиПоследнейЗаписи.Идентификатор = Срез.Идентификатор
	|				И КлючиПоследнейЗаписи.ДатаВремяПоследнейЗаписи = Срез.ДатаВремя
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				Очередь.Идентификатор КАК Идентификатор,
	|				МИНИМУМ(Очередь.ДатаВремя) КАК ДатаВремяПостановки
	|			ИЗ
	|				РегистрСведений.ИАДО_ОчередьРаспознаванияФайлов КАК Очередь
	|			СГРУППИРОВАТЬ ПО
	|				Очередь.Идентификатор) КАК Постановка
	|			ПО Срез.Идентификатор = Постановка.Идентификатор
	|	ГДЕ
	|		Срез.Статус = ""Ожидает"") КАК АктуальныеОжидающие
	|
	|УПОРЯДОЧИТЬ ПО
	|	АктуальныеОжидающие.ДатаВремяПостановки";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Строка(Выборка.Идентификатор);
	КонецЕсли;

	Возврат "";

КонецФункции

Процедура ИАДО_ЗавершитьОчередьРаспознавания(
	Знач ИдентификаторОчереди,
	Знач ДокументСсылка,
	Знач ФайлСсылка,
	Знач Статус,
	Знач Сообщение)

	ИАДО_ОбновитьСтатусОчередиРаспознавания(ИдентификаторОчереди, ДокументСсылка, ФайлСсылка, Статус, Сообщение);

КонецПроцедуры

Процедура ИАДО_ОбновитьСтатусОчередиРаспознавания(
	Знач ИдентификаторОчереди,
	Знач ДокументСсылка,
	Знач ФайлСсылка,
	Знач Статус,
	Знач Сообщение)

	НаборЗаписей = РегистрыСведений.ИАДО_ОчередьРаспознаванияФайлов.СоздатьНаборЗаписей();
	Запись = НаборЗаписей.Добавить();
	Запись.ДатаВремя = ТекущаяУниверсальнаяДата();
	Запись.Идентификатор = ИдентификаторОчереди;
	Запись.Статус = Лев(Статус, 20);
	Запись.Файл = ФайлСсылка;
	Запись.Документ = ДокументСсылка;
	Запись.Сообщение = Лев(Строка(Сообщение), 512);
	НаборЗаписей.Записать(Ложь);

КонецПроцедуры

Процедура ИАДО_ЗаписатьСобытиеЖурналаИИ(Знач ПараметрыСобытия)

	ПарамЖурнал = Новый Структура;
	ПарамЖурнал.Вставить("ВидОперации", ПараметрыСобытия.ВидОперации);
	ПарамЖурнал.Вставить("Успешно", ПараметрыСобытия.Успешно);
	ПарамЖурнал.Вставить("Сообщение", ПараметрыСобытия.Сообщение);
	Если ПараметрыСобытия.Свойство("Документ") Тогда
		ПарамЖурнал.Вставить("Документ", ПараметрыСобытия.Документ);
	КонецЕсли;
	Если ПараметрыСобытия.Свойство("Файл") Тогда
		ПарамЖурнал.Вставить("Файл", ПараметрыСобытия.Файл);
	КонецЕсли;
	Если ПараметрыСобытия.Свойство("ИмяМодели") Тогда
		ПарамЖурнал.Вставить("ИмяМодели", ПараметрыСобытия.ИмяМодели);
	КонецЕсли;
	Если ПараметрыСобытия.Свойство("ИсточникТекстаФайла") Тогда
		ПарамЖурнал.Вставить("ИсточникТекстаФайла", ПараметрыСобытия.ИсточникТекстаФайла);
	КонецЕсли;
	Если ПараметрыСобытия.Свойство("HTTPКод") Тогда
		ПарамЖурнал.Вставить("HTTPКод", ПараметрыСобытия.HTTPКод);
	КонецЕсли;
	Если ПараметрыСобытия.Свойство("ТекстОтветаКратко") Тогда
		ПарамЖурнал.Вставить("ТекстОтветаКратко", ПараметрыСобытия.ТекстОтветаКратко);
	КонецЕсли;
	Если ПараметрыСобытия.Свойство("Детали") Тогда
		ПарамЖурнал.Вставить("Детали", ПараметрыСобытия.Детали);
	КонецЕсли;

	ИАДО_ЖурналИИВызовСервера.ДобавитьЗапись(ПарамЖурнал);

КонецПроцедуры

Функция ИАДО_РаспознаваниеФайлаДоступноПередАнализомИИ(Знач ФайлСсылка)

	Если Не РаботаСФайламиВызовСервера.ПолучитьИспользоватьРаспознаваниеТекста() Тогда
		Возврат Ложь;
	КонецЕсли;

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФайлСсылка, "Зашифрован, ТекущаяВерсияРасширение");
	Если Реквизиты.Зашифрован Тогда
		Возврат Ложь;
	КонецЕсли;

	ИспользоватьImageMagick = РаботаСФайламиВызовСервера.ПолучитьИспользоватьImageMagickДляРаспознаванияPDF();
	Если Не РаботаСФайламиВызовСервера.ИспользоватьGhostscript() Тогда
		ИспользоватьImageMagick = Ложь;
	КонецЕсли;

	ПараметрыПроверки = РаботаСФайламиКлиентСервер.ОписаниеПараметровПроверкиВозможностиРаспознавания();
	ПараметрыПроверки.ИспользоватьImageMagick = ИспользоватьImageMagick;
	ПараметрыПроверки.ПрограммаРаспознавания = РаботаСФайламиВызовСервера.ПрограммаРаспознавания();

	Расширение = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(Строка(Реквизиты.ТекущаяВерсияРасширение));

	Возврат РаботаСФайламиКлиентСервер.ЭтотФайлМожноРаспознать(Расширение, ПараметрыПроверки);

КонецФункции

// Заглушка для ветки Исключение: вложение с ответом ИИ не обязательно для успешного анализа.
Процедура ИАДО_ИгнорироватьОшибкуСозданияВложенияОтветаИИ()
	Возврат;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
